{
  "name": "Tool Bindings",
  "category": "tfc:better_stone_age",
  "icon": "minecraft:string",
  "pages": [
    {
      "type": "patchouli:text",
      "text": ""
    },
    {
      "type": "patchouli:text",
      "text": "In Better Stone Age, tool heads can be bound to their handles. If there is no binding, the tool's durability is penalized. However, stronger bindings also grant higher forging bonuses to the tool they are used to craft."
    },
    {
      "type": "patchouli:text",
      "text": "When you first load a world of TerraFirmaCraft, your first tools will likely be made without any sort of binding between the tool head and handle at all. This is done by a process known as hafting, in which the handle is split and the tool head is wedged into the crack and held there with friction."
    },
    {
      "type": "patchouli:crafting",
      "text": "Since there is nothing binding the head to the handle, this tool is extremely fragile, and has only half its durability when crafted.",
      "recipe": "better_stone_age:crafting/stone/knife/igneous_extrusive/no_binding"
    },
    {
      "type": "patchouli:text",
      "text": "Once you have hafted a stone knife, you can use it to break tall grass to obtain $(bold)Straw$(), which can be used to bind the tool a little more securely.$(br)$(br)If you are lucky, you might find some $(bold)Dead Grass$() on the ground, which will allow you to do this without needing to haft a knife at all."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "better_stone_age:crafting/stone/axe/igneous_extrusive/weak_binding"
    },
    {
      "type": "patchouli:text",
      "text": "During your travels, you may find other, stronger plants that you can use to more effectively bind your tools. Tools bound with these plants have the $(bold)Well Forged$() trait."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "better_stone_age:crafting/stone/shovel/igneous_extrusive/medium_binding"
    },
    {
      "type": "patchouli:text",
      "text": "The highest tier of tool binding is processed string-like items, such as $(bold)Jute Fibers$(), $(bold)Wool Yarn$(), or $(bold)$(l:tfc:better_stone_age/sinew_processing)Sinew String$(). $(bold)Spider Silk$(), dropped by spiders and cobwebs, is also of this caliber.$(br)$(br)Tools bound with these materials have the $(bold)Perfectly Forged$() trait."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "better_stone_age:crafting/stone/javelin/igneous_extrusive/strong_binding"
    }
  ],
  "read_by_default": true,
  "sortnum": 0

}